<a href="https://colab.research.google.com/github/farhanns481/notes/blob/main/database.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import sqlite3

conn= sqlite3.connect("students.db")
cursor = conn.cursor()

In [ ]:
from typing import Text

cursor.execute("""CREATE TABLE IF NOT EXISTS students(
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    age INTEGER,
    gender TEXT,
    grade TEXT
    )
""")

In [ ]:
cursor.execute("insert into students values  (1,'AAA',18,'F','A+')")

In [ ]:
cursor.execute("insert into students values  (2,'BBB',20,'M','B+')")

In [ ]:
cursor.execute("insert into students values  (3,'CCC',20,'F','C+')")

In [ ]:
cursor.execute("insert into students values  (4,'DDD',21,'M','A+')")

In [ ]:
cursor.execute("insert into students values  (5,'EEE',22,'M','D+')")

In [ ]:
conn.commit()

In [ ]:
cursor.execute("SELECT * FROM students")

In [ ]:
rows = (cursor.fetchall())

In [ ]:
for row in rows:
  print("ID:",row[0],"name:",row[1],"age:",row[2],"gender:",row[3],"grade:",row[4])

ID: 1 name: AAA age: 18 gender: F grade: A+
ID: 2 name: BBB age: 20 gender: M grade: B+
ID: 3 name: CCC age: 20 gender: F grade: C+
ID: 4 name: DDD age: 21 gender: M grade: A+
ID: 5 name: EEE age: 22 gender: M grade: D+

In [ ]:
cursor.execute("select * from students where grade = 'B+'")
rows = cursor.fetchall()
for row in rows:
  print("ID:",row[0],"name:",row[1],"age:",row[2],"gender:",row[3],"grade:",row[4])

ID: 2 name: BBB age: 20 gender: M grade: B+

In [ ]:
cursor.execute("select * from students order by age desc")
rows = cursor.fetchall()
for row in rows:
  print("ID:",row[0],"name:",row[1],"age:",row[2],"gender:",row[3],"grade:",row[4])

ID: 4 name: DDD age: 21 gender: M grade: A+
ID: 2 name: BBB age: 20 gender: M grade: B+
ID: 3 name: CCC age: 20 gender: F grade: C+
ID: 1 name: AAA age: 18 gender: F grade: A+

In [ ]:
cursor.execute("select count(*) from students where grade = 'A+'")
rows = cursor.fetchall()
for row in rows:
  print("grade:",row[0])

grade: 2

In [ ]:
cursor.execute("select avg(age) from students where age<17")
rows = cursor.fetchall()
for row in rows:
  print("age:",row[0])

age: None

In [ ]:
cursor.execute("select * from students order by age desc limit 3")
rows = cursor.fetchall()
for row in rows:
  print("ID:",row[0],"name:",row[1],"age:",row[2],"gender:",row[3],"grade:",row[4])

ID: 4 name: DDD age: 21 gender: M grade: A+
ID: 2 name: BBB age: 20 gender: M grade: B+
ID: 3 name: CCC age: 20 gender: F grade: C+

In [ ]:
cursor.execute("select age,count(*) from students group by age")
rows = cursor.fetchall()
for row in rows:
  print("age:",row[0])

age: 18
age: 20
age: 21

In [ ]:
cursor.execute("alter table students add column mark integer")

OperationalError: duplicate column name: mark

In [ ]:
cursor.execute("update students set mark = 70 where id = 1 ")
cursor.execute("update students set mark = 80 where id = 2 ")
cursor.execute("update students set mark = 45 where id = 3 ")
cursor.execute("update students set mark = 90 where id = 4 ")
cursor.execute("update students set mark = 95 where id = 5 ")

In [ ]:
cursor.execute("select * from students")
rows = cursor.fetchall()
for row in rows:
  print("ID:",row[0],"name:",row[1],"age:",row[2],"gender:",row[3],"grade:",row[4],"mark:",row[5])

ID: 1 name: AAA age: 18 gender: F grade: A+ mark: 70
ID: 2 name: BBB age: 20 gender: M grade: B+ mark: 80
ID: 3 name: CCC age: 20 gender: F grade: C+ mark: 45
ID: 4 name: DDD age: 21 gender: M grade: A+ mark: 90
ID: 5 name: EEE age: 22 gender: M grade: D+ mark: 95

In [ ]:
cursor.execute("delete from students where id = 5")

In [ ]:
cursor.execute("select * from students")
rows = cursor.fetchall()
for row in rows:
  print("ID:",row[0],"name:",row[1],"age:",row[2],"gender:",row[3],"grade:",row[4],"mark:",row[5])

ID: 1 name: AAA age: 18 gender: F grade: A+ mark: 70
ID: 2 name: BBB age: 20 gender: M grade: B+ mark: 80
ID: 3 name: CCC age: 20 gender: F grade: C+ mark: 45
ID: 4 name: DDD age: 21 gender: M grade: A+ mark: 90